app/controllers/students_controller.rb

SELECT * FROM "course_classes" WHERE ("course_classes"."id" = 1)
SELECT "students".* FROM "students" INNER JOIN "student_classes" ON "students".id = "student_classes".student_id WHERE (("student_classes".course_class_id = 1))
---
  def index
    if params[:course_class_id]
      @course_class = CourseClass.find(params[:course_class_id])
      @students = @course_class.students
    else
      @students = Student.all

SELECT * FROM "students" WHERE ("students"."id" = 1) LIMIT 1
---
  def show
    @student = Student.find(params[:id])

SELECT * FROM "students" WHERE ("students"."id" = 1)
---
  def edit
    @student = Student.find(params[:id])

INSERT INTO "students" ("encrypted_password", "name", "created_at", "birthdate", "last_sign_in_ip", "cpf", "updated_at", "last_sign_in_at", "sign_in_count", "password_salt", "address_id", "reset_password_token", "remember_token", "current_sign_in_ip", "phone", "remember_created_at", "current_sign_in_at", "marital_status", "email", "rg", "birthplace") VALUES('', 'Aluno Dois', '2010-07-01 11:17:05', '2010-07-01', NULL, '123456789', '2010-07-01 11:17:05', NULL, 0, '', NULL, NULL, NULL, NULL, '', NULL, NULL, NULL, '', '', '')
---
  def create
    @student = Student.new(params[:student])

    respond_to do |format|
      if @student.save

SELECT * FROM "students" WHERE ("students"."id" = 1)
UPDATE "students" SET "phone" = '1230982346', "updated_at" = '2010-08-04 11:43:37', "email" = 'freireag@gmail.com', "rg" = '1223019812', "marital_status" = 'solteiro', "birthplace" = 'brasileiro' WHERE "id" = 1
---
  def update
    @student = Student.find(params[:id])

    respond_to do |format|
      if @student.update_attributes(params[:student])

SELECT * FROM "students" WHERE ("students"."id" = 1)
DELETE FROM "students" WHERE "id" = 1
---
  def destroy
    @student = Student.find(params[:id])
    @student.destroy

SELECT * FROM "students" WHERE ("students"."id" = 1)
---
  def warning
    @student = Student.find(params[:id])