app/controllers/users_controller.rb

INSERT INTO "users" ("encrypted_password", "name", "created_at", "last_sign_in_ip", "updated_at", "last_sign_in_at", "role", "sign_in_count", "password_salt", "reset_password_token", "remember_token", "current_sign_in_ip", "remember_created_at", "current_sign_in_at", "login", "email") VALUES('18f9a8c708a75644b8c94d6ac3a173fe03804e77', 'Aluno Dois', '2010-06-27 21:29:00', NULL, '2010-06-27 21:29:00', NULL, NULL, 0, 'QScrc-BA5V3vcMIl2PmD', NULL, NULL, NULL, NULL, NULL, 'alunodois', '')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save